import React, { lazy } from "react";
import {
  CBadge,
  CButton,
  CButtonGroup,
  CCard,
  CCardBody,
  CCardFooter,
  CCardHeader,
  CCol,
  CProgress,
  CRow,
  CCallout,
} from "@coreui/react";

// import MainChartExample from "../charts/MainChartExample.js";

// const WidgetsDropdown = lazy(() => import("../widgets/WidgetsDropdown.js"));
// const WidgetsBrand = lazy(() => import("../widgets/WidgetsBrand.js"));

const History = () => {
  return (
    <>
     
      <CCard>
        <CCardBody>
          <CRow>
            <CCol sm="5">
              <h4 id="traffic" className="card-title mb-0">
                Our History
              </h4>
              {/* <div className="small text-muted">November 2017</div> */}
            </CCol>
            
          </CRow>
          {/* <MainChartExample style={{ height: "300px", marginTop: "40px" }} /> */}
        </CCardBody>
        <CCardFooter>
          <CRow className="">
            <CCol>
            <p>ભાટિયા જાતિની ભૌગોલિક ઉત્પત્તિ અનિશ્ચિત છે. બ્રિટિશ રાજના એથનોગ્રાફર ડેન્ઝિલ ઇબ્બેટસને નોંધ્યું હતું કે 19 મી સદીમાં સિંધ અને ગુજરાતમાં ઘણા લોકો મળી આવ્યા હતા પરંતુ એવું માનવા માટેના આધાર હતા કે તેઓ ભટનેર, જેસલમેર અને તે સમયે રાજપૂતાના તરીકે ઓળખાતા વિસ્તારમાંથી સ્થળાંતરિત થયા હતા. દિવસ રાજસ્થાન). આન્દ્રે વિંકના તાજેતરના અભ્યાસમાં જેસલમેરના ભાટિયાઓ અને ગુજરાતના કૌલુક્યાઓ વચ્ચે 12 મી સદીનું જોડાણ જોવા મળે છે, જ્યારે એન્થોની ઓ'બ્રાયને તેમના વતનને શોધવાના લગભગ સમકાલીન પ્રયાસોને કારણે તેમને 7 મી સદીથી સિંધની આસપાસ મૂક્યા. વિંક, જેઓ મધ્યયુગીન અને પ્રારંભિક આધુનિક ભારતીય ઇતિહાસમાં રુચિ ધરાવતા પ્રોફેસર છે, નોંધે છે કે ફિરોઝ શાહ તુગલકના શાસન દરમિયાન સિંધમાં ઘણા સમુદાયે ઇસ્લામ સ્વીકાર્યો હતો, જો કે રોબર્ટ વેન રસેલ, અન્ય રાજ ​​એથનોગ્રાફરનો અભિપ્રાય હતો કે તે 19મી સદીમાં વિદેશી વેપારમાં રોકાયેલા લોકો ફક્ત હિન્દુ હતા.</p>
            <p>ખાસ કરીને સિંધના મુલ્તાન વિસ્તાર સાથે સંકળાયેલા ભાટિયાઓ history રીતે વેપારી હતા અને તેઓ કદાચ ભોરા અને લોહાણા સમુદાયો સાથે મળીને મધ્ય એશિયામાં મળેલા પ્રારંભિક ભારતીય ડાયસ્પોરાનો ભાગ બન્યા હતા. તેમનો ઉદભવ એક તરીકે નોંધપાત્ર વેપારી જૂથ 17 મી સદીની પૂર્વ-તારીખ ધરાવે છે અને ચોક્કસપણે ભારત વસાહતી શાસનને આધિન બન્યું ત્યાં સુધીમાં, ભાટિયાઓ અને અન્ય બે પ્રારંભિક ડાયસ્પોરા સમુદાયોએ વેપાર અને નાણાંકીય નેટવર્કની સ્થાપના કરી હતી, જે ઇતિહાસમાં નિષ્ણાત સ્કોટ લેવીના જણાવ્યા મુજબ. મધ્ય એશિયા, "... સમગ્ર અફઘાનિસ્તાન, મધ્ય એશિયામાં ફેલાયેલું અને છેવટે અરબી દ્વીપકલ્પ અને પૂર્વ આફ્રિકાથી આગળ પશ્ચિમમાં કેરેબિયન ટાપુઓ સુધી અને પૂર્વમાં દક્ષિણપૂર્વ એશિયા અને ચીન સુધી પહોંચ્યું."</p>
            </CCol>
          </CRow>
        </CCardFooter>
      </CCard>

      
    </>
  );
};

export default History;
